This is a revision file of python

In [3]:
import pandas as pd 
data={
    "Name":['Ronit','Rishi','Rahul','Ansh','Sohail','Sridhar','Atharava','Rounak'],
    "Age":[20,21,22,21,22,23,20,22],
    "Salary":[1000,200,300,100,400,200,1000,200],
    "Performance_Measure":[10,7,8,9,4,5,7,10]
}
df=pd.DataFrame(data)
print(df)

       Name  Age  Salary  Performance_Measure
0     Ronit   20    1000                   10
1     Rishi   21     200                    7
2     Rahul   22     300                    8
3      Ansh   21     100                    9
4    Sohail   22     400                    4
5   Sridhar   23     200                    5
6  Atharava   20    1000                    7
7    Rounak   22     200                   10

In [5]:
df=pd.read_csv('sales_data_sample.csv',encoding="latin1")
print(df)

      ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER    SALES  \
0           10107               30      95.70                2  2871.00
1           10121               34      81.35                5  2765.90
2           10134               41      94.74                2  3884.34
3           10145               45      83.26                6  3746.70
4           10159               49     100.00               14  5205.27
...           ...              ...        ...              ...      ...
2818        10350               20     100.00               15  2244.40
2819        10373               29     100.00                1  3978.51
2820        10386               43     100.00                4  5417.57
2821        10397               34      62.24                1  2116.16
2822        10414               47      65.52                9  3079.44

            ORDERDATE    STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  \
0      2/24/2003 0:00   Shipped       1         2     2003  ...
1       5/7/2003 0:00   Shipped       2         5     2003  ...
2       7/1/2003 0:00   Shipped       3         7     2003  ...
3      8/25/2003 0:00   Shipped       3         8     2003  ...
4     10/10/2003 0:00   Shipped       4        10     2003  ...
...               ...       ...     ...       ...      ...  ...
2818   12/2/2004 0:00   Shipped       4        12     2004  ...
2819   1/31/2005 0:00   Shipped       1         1     2005  ...
2820    3/1/2005 0:00  Resolved       1         3     2005  ...
2821   3/28/2005 0:00   Shipped       1         3     2005  ...
2822    5/6/2005 0:00   On Hold       2         5     2005  ...

                       ADDRESSLINE1  ADDRESSLINE2           CITY STATE  \
0           897 Long Airport Avenue           NaN            NYC    NY
1                59 rue de l'Abbaye           NaN          Reims   NaN
2     27 rue du Colonel Pierre Avia           NaN          Paris   NaN
3                78934 Hillside Dr.           NaN       Pasadena    CA
4                   7734 Strong St.           NaN  San Francisco    CA
...                             ...           ...            ...   ...
2818             C/ Moralzarzal, 86           NaN         Madrid   NaN
2819                    Torikatu 38           NaN           Oulu   NaN
2820             C/ Moralzarzal, 86           NaN         Madrid   NaN
2821          1 rue Alsace-Lorraine           NaN       Toulouse   NaN
2822             8616 Spinnaker Dr.           NaN         Boston    MA

     POSTALCODE  COUNTRY TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME DEALSIZE
0         10022      USA       NaN              Yu             Kwai    Small
1         51100   France      EMEA         Henriot             Paul    Small
2         75508   France      EMEA        Da Cunha           Daniel   Medium
3         90003      USA       NaN           Young            Julie   Medium
4           NaN      USA       NaN           Brown            Julie   Medium
...         ...      ...       ...             ...              ...      ...
2818      28034    Spain      EMEA          Freyre            Diego    Small
2819      90110  Finland      EMEA       Koskitalo           Pirkko   Medium
2820      28034    Spain      EMEA          Freyre            Diego   Medium
2821      31000   France      EMEA          Roulet          Annette    Small
2822      51003      USA       NaN         Yoshido             Juri   Medium

[2823 rows x 25 columns]

In [7]:
print(pd.read_excel('SampleSuperstore.xlsx'))

      Row ID        Order ID Order Date  Ship Date       Ship Mode  \
0          1  CA-2016-152156 2016-11-08 2016-11-11    Second Class
1          2  CA-2016-152156 2016-11-08 2016-11-11    Second Class
2          3  CA-2016-138688 2016-06-12 2016-06-16    Second Class
3          4  US-2015-108966 2015-10-11 2015-10-18  Standard Class
4          5  US-2015-108966 2015-10-11 2015-10-18  Standard Class
...      ...             ...        ...        ...             ...
9989    9990  CA-2014-110422 2014-01-21 2014-01-23    Second Class
9990    9991  CA-2017-121258 2017-02-26 2017-03-03  Standard Class
9991    9992  CA-2017-121258 2017-02-26 2017-03-03  Standard Class
9992    9993  CA-2017-121258 2017-02-26 2017-03-03  Standard Class
9993    9994  CA-2017-119914 2017-05-04 2017-05-09    Second Class

     Customer ID     Customer Name    Segment        Country             City  \
0       CG-12520       Claire Gute   Consumer  United States        Henderson
1       CG-12520       Claire Gute   Consumer  United States        Henderson
2       DV-13045   Darrin Van Huff  Corporate  United States      Los Angeles
3       SO-20335    Sean O'Donnell   Consumer  United States  Fort Lauderdale
4       SO-20335    Sean O'Donnell   Consumer  United States  Fort Lauderdale
...          ...               ...        ...            ...              ...
9989    TB-21400  Tom Boeckenhauer   Consumer  United States            Miami
9990    DB-13060       Dave Brooks   Consumer  United States       Costa Mesa
9991    DB-13060       Dave Brooks   Consumer  United States       Costa Mesa
9992    DB-13060       Dave Brooks   Consumer  United States       Costa Mesa
9993    CC-12220      Chris Cortes   Consumer  United States      Westminster

      ... Postal Code  Region       Product ID         Category Sub-Category  \
0     ...       42420   South  FUR-BO-10001798        Furniture    Bookcases
1     ...       42420   South  FUR-CH-10000454        Furniture       Chairs
2     ...       90036    West  OFF-LA-10000240  Office Supplies       Labels
3     ...       33311   South  FUR-TA-10000577        Furniture       Tables
4     ...       33311   South  OFF-ST-10000760  Office Supplies      Storage
...   ...         ...     ...              ...              ...          ...
9989  ...       33180   South  FUR-FU-10001889        Furniture  Furnishings
9990  ...       92627    West  FUR-FU-10000747        Furniture  Furnishings
9991  ...       92627    West  TEC-PH-10003645       Technology       Phones
9992  ...       92627    West  OFF-PA-10004041  Office Supplies        Paper
9993  ...       92683    West  OFF-AP-10002684  Office Supplies   Appliances

                                           Product Name     Sales  Quantity  \
0                     Bush Somerset Collection Bookcase  261.9600         2
1     Hon Deluxe Fabric Upholstered Stacking Chairs,...  731.9400         3
2     Self-Adhesive Address Labels for Typewriters b...   14.6200         2
3         Bretford CR4500 Series Slim Rectangular Table  957.5775         5
4                        Eldon Fold 'N Roll Cart System   22.3680         2
...                                                 ...       ...       ...
9989                             Ultra Door Pull Handle   25.2480         3
9990  Tenex B1-RE Series Chair Mats for Low Pile Car...   91.9600         2
9991                              Aastra 57i VoIP phone  258.5760         2
9992  It's Hot Message Books with Stickers, 2 3/4" x 5"   29.6000         4
9993  Acco 7-Outlet Masterpiece Power Center, Wihtou...  243.1600         2

      Discount    Profit
0         0.00   41.9136
1         0.00  219.5820
2         0.00    6.8714
3         0.45 -383.0310
4         0.20    2.5164
...        ...       ...
9989      0.20    4.1028
9990      0.00   15.6332
9991      0.20   19.3932
9992      0.00   13.3200
9993      0.00   72.9480

[9994 rows x 21 columns]

In [8]:
print(pd.read_json('sample_Data.json'))

    id                                               name  \
0    1                                    Apple iPhone 12
1    2                                 Samsung Galaxy S21
2    3                                 Sony PlayStation 5
3    4                  LG OLED55CXPUA 55-inch 4K OLED TV
4    5        Bose QuietComfort 35 II Wireless Headphones
5    6                          Fitbit Versa 3 Smartwatch
6    7                             KitchenAid Stand Mixer
7    8                 Dyson V11 Absolute Cordless Vacuum
8    9                         Ninja Foodi Smart XL Grill
9   10                    Canon EOS Rebel T8i DSLR Camera
10  11                                  Apple AirPods Pro
11  12        Bose QuietComfort 35 II Wireless Headphones
12  13                    Fitbit Charge 4 Fitness Tracker
13  14                              Samsung Galaxy Watch3
14  15  Sony WH-1000XM4 Wireless Noise-Cancelling Head...
15  16          Breville Barista Express Espresso Machine
16  17                        Keurig K-Elite Coffee Maker
17  18                     iRobot Roomba i7+ Robot Vacuum
18  19                   Ninja Foodi Digital Air Fry Oven
19  20                   Cuisinart ICE-70 Ice Cream Maker

                                          description    price  \
0   The Apple iPhone 12 features a 6.1-inch Super ...   999.00
1   The Samsung Galaxy S21 features a 6.2-inch Dyn...   799.00
2   The Sony PlayStation 5 features an AMD Zen 2-b...   499.99
3   The LG OLED55CXPUA 55-inch 4K OLED TV features...  1599.99
4   The Bose QuietComfort 35 II Wireless Headphone...   299.00
5   The Fitbit Versa 3 Smartwatch features a built...   229.95
6   The KitchenAid Stand Mixer features a 5-quart ...   399.99
7   The Dyson V11 Absolute Cordless Vacuum feature...   699.99
8   The Ninja Foodi Smart XL Grill features 6-in-1...   279.99
9   The Canon EOS Rebel T8i DSLR Camera features a...   899.00
10  The Apple AirPods Pro feature active noise can...   249.00
11  The Bose QuietComfort 35 II Wireless Headphone...   299.00
12  The Fitbit Charge 4 Fitness Tracker features G...   129.95
13  The Samsung Galaxy Watch3 features a rotating ...   399.99
14  The Sony WH-1000XM4 Wireless Noise-Cancelling ...   349.99
15  The Breville Barista Express Espresso Machine ...   699.95
16  The Keurig K-Elite Coffee Maker features a str...   169.99
17  The iRobot Roomba i7+ Robot Vacuum features au...   799.99
18  The Ninja Foodi Digital Air Fry Oven features ...   209.99
19  The Cuisinart ICE-70 Ice Cream Maker features ...   139.99

           category                                              image
0       Electronics  https://www.apple.com/newsroom/images/product/...
1       Electronics  https://images.samsung.com/is/image/samsung/p6...
2       Electronics  https://www.sony.com/image/44baa604124b770c824...
3       Electronics  https://www.lg.com/us/images/tvs/md07501804/ga...
4       Electronics  https://assets.bose.com/content/dam/Bose_DAM/W...
5       Electronics  https://www.fitbit.com/global/content/dam/fitb...
6    Home & Kitchen  https://www.kitchenaid.com/content/dam/global/...
7   Home Appliances  https://www.dysoncanada.ca/dam/dyson/images/pr...
8    Home & Kitchen  https://www.ninjakitchen.com/medias/Ninja-OP50...
9       Electronics  https://www.canon.com.au/-/media/images/produc...
10      Electronics  https://www.apple.com/v/airpods-pro/b/images/m...
11      Electronics  https://assets.bose.com/content/dam/Bose_DAM/W...
12      Electronics  https://www.fitbit.com/global/content/dam/fitb...
13      Electronics  https://images.samsung.com/is/image/samsung/as...
14      Electronics  https://www.sony.com/image/1cdd6354c4cd21cc4f7...
15   Home & Kitchen  https://www.breville.com/content/dam/breville/...
16   Home & Kitchen  https://www.keurig.com/content/dam/global-ecom...
17   Home & Kitchen  https://store.irobot.com/default/i7-vacuuming-...
18   Home & Kitchen  https://www.ninjakitchen.com/static/img/produc...
19   Home & Kitchen  https://www.cuisinart.com/share/images/product...

In [20]:
data={
    "Name":['Ronit','Rishi','Rahul','Ansh','Sohail','Sridhar','Atharava','Rounak'],
    "Age":[20,21,22,21,22,23,20,22],
    "Salary":[1000,200,300,100,400,200,1000,200],
    "Performance_Measure":[10,7,8,9,4,5,7,10]
}
df=pd.DataFrame(data)
print(df)

       Name  Age  Salary  Performance_Measure
0     Ronit   20    1000                   10
1     Rishi   21     200                    7
2     Rahul   22     300                    8
3      Ansh   21     100                    9
4    Sohail   22     400                    4
5   Sridhar   23     200                    5
6  Atharava   20    1000                    7
7    Rounak   22     200                   10

In [12]:
df.to_csv("Csv2_file.csv",index=False)

In [13]:
df.to_json("Json2_file.json")

In [14]:
print(df.head(2))

    Name  Age  Salary  Performance_Measure
0  Ronit   20    1000                   10
1  Rishi   21     200                    7

In [15]:
print(df.tail(2))

       Name  Age  Salary  Performance_Measure
6  Atharava   20    1000                    7
7    Rounak   22     200                   10

In [16]:
print(df.head())

     Name  Age  Salary  Performance_Measure
0   Ronit   20    1000                   10
1   Rishi   21     200                    7
2   Rahul   22     300                    8
3    Ansh   21     100                    9
4  Sohail   22     400                    4

In [17]:
print(df.tail())

       Name  Age  Salary  Performance_Measure
3      Ansh   21     100                    9
4    Sohail   22     400                    4
5   Sridhar   23     200                    5
6  Atharava   20    1000                    7
7    Rounak   22     200                   10

In [18]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Name                 8 non-null      object
 1   Age                  8 non-null      int64
 2   Salary               8 non-null      int64
 3   Performance_Measure  8 non-null      int64
dtypes: int64(3), object(1)
memory usage: 388.0+ bytes
None

In [21]:
print(df.describe())
print(df)

            Age       Salary  Performance_Measure
count   8.00000     8.000000             8.000000
mean   21.37500   425.000000             7.500000
std     1.06066   365.474252             2.203893
min    20.00000   100.000000             4.000000
25%    20.75000   200.000000             6.500000
50%    21.50000   250.000000             7.500000
75%    22.00000   550.000000             9.250000
max    23.00000  1000.000000            10.000000
       Name  Age  Salary  Performance_Measure
0     Ronit   20    1000                   10
1     Rishi   21     200                    7
2     Rahul   22     300                    8
3      Ansh   21     100                    9
4    Sohail   22     400                    4
5   Sridhar   23     200                    5
6  Atharava   20    1000                    7
7    Rounak   22     200                   10

In [22]:
print(df.shape)

(8, 4)

In [23]:
print(df.columns)

Index(['Name', 'Age', 'Salary', 'Performance_Measure'], dtype='object')

In [24]:
print(df["Name"])

0       Ronit
1       Rishi
2       Rahul
3        Ansh
4      Sohail
5     Sridhar
6    Atharava
7      Rounak
Name: Name, dtype: object

In [25]:
print(df["Age"])

0    20
1    21
2    22
3    21
4    22
5    23
6    20
7    22
Name: Age, dtype: int64

In [26]:
print(df[["Age","Name"]])

   Age      Name
0   20     Ronit
1   21     Rishi
2   22     Rahul
3   21      Ansh
4   22    Sohail
5   23   Sridhar
6   20  Atharava
7   22    Rounak

In [27]:
# To access rows based on given condition

In [28]:
print(df["Age"]>22)

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7    False
Name: Age, dtype: bool

In [29]:
print(df[df["Age"]>22])

      Name  Age  Salary  Performance_Measure
5  Sridhar   23     200                    5

In [32]:
print(df[(df["Age"]>21)&(df["Salary"]>300)])

     Name  Age  Salary  Performance_Measure
4  Sohail   22     400                    4

In [33]:
gf=pd.read_csv("Csv2_file.csv",encoding="latin1")
print(gf.head())

     Name  Age  Salary  Performance_Measure
0   Ronit   20    1000                   10
1   Rishi   21     200                    7
2   Rahul   22     300                    8
3    Ansh   21     100                    9
4  Sohail   22     400                    4

Adding new column to the data set .

In [1]:
import pandas as pd

In [2]:
data={
    "Name":['Ronit','Rishi','Rahul','Ansh','Sohail','Sridhar','Atharava','Rounak'],
    "Age":[20,21,22,21,22,23,20,22],
    "Salary":[1000,200,300,100,400,200,1000,200],
    "Performance_Measure":[10,7,8,9,4,5,7,10]
}
df=pd.DataFrame(data)

In [3]:
df["Behaviour"]=["Good","Bad","Bad","Good","Good","Good","Good","Good"]

In [4]:
print(df)

       Name  Age  Salary  Performance_Measure Behaviour
0     Ronit   20    1000                   10      Good
1     Rishi   21     200                    7       Bad
2     Rahul   22     300                    8       Bad
3      Ansh   21     100                    9      Good
4    Sohail   22     400                    4      Good
5   Sridhar   23     200                    5      Good
6  Atharava   20    1000                    7      Good
7    Rounak   22     200                   10      Good

Inserting column at particular index .

In [5]:
df.insert(3,"Intelligence",[10,2,5,3,10,2,8,10])

In [6]:
print(df)

       Name  Age  Salary  Intelligence  Performance_Measure Behaviour
0     Ronit   20    1000            10                   10      Good
1     Rishi   21     200             2                    7       Bad
2     Rahul   22     300             5                    8       Bad
3      Ansh   21     100             3                    9      Good
4    Sohail   22     400            10                    4      Good
5   Sridhar   23     200             2                    5      Good
6  Atharava   20    1000             8                    7      Good
7    Rounak   22     200            10                   10      Good

Updating specific cell

In [7]:
df.loc[2,"Intelligence"]=9

In [8]:
print(df)

       Name  Age  Salary  Intelligence  Performance_Measure Behaviour
0     Ronit   20    1000            10                   10      Good
1     Rishi   21     200             2                    7       Bad
2     Rahul   22     300             9                    8       Bad
3      Ansh   21     100             3                    9      Good
4    Sohail   22     400            10                    4      Good
5   Sridhar   23     200             2                    5      Good
6  Atharava   20    1000             8                    7      Good
7    Rounak   22     200            10                   10      Good

Removing column from a data set

In [9]:
df.drop(columns=["Behaviour"],inplace=True)

In [10]:
print(df)

       Name  Age  Salary  Intelligence  Performance_Measure
0     Ronit   20    1000            10                   10
1     Rishi   21     200             2                    7
2     Rahul   22     300             9                    8
3      Ansh   21     100             3                    9
4    Sohail   22     400            10                    4
5   Sridhar   23     200             2                    5
6  Atharava   20    1000             8                    7
7    Rounak   22     200            10                   10

Removing multiple column from a data set .

In [11]:
df["fuck"]=['no','no','no','no','no','yes','no','no']
df["Girl_friend"]=["no","yes","yes","no","no","no","yes","no"]
print(df)

       Name  Age  Salary  Intelligence  Performance_Measure fuck Girl_friend
0     Ronit   20    1000            10                   10   no          no
1     Rishi   21     200             2                    7   no         yes
2     Rahul   22     300             9                    8   no         yes
3      Ansh   21     100             3                    9   no          no
4    Sohail   22     400            10                    4   no          no
5   Sridhar   23     200             2                    5  yes          no
6  Atharava   20    1000             8                    7   no         yes
7    Rounak   22     200            10                   10   no          no

Removing multiple column from a data set

In [12]:
df.drop(columns=["fuck","Girl_friend"],inplace=True)

In [13]:
print(df)

       Name  Age  Salary  Intelligence  Performance_Measure
0     Ronit   20    1000            10                   10
1     Rishi   21     200             2                    7
2     Rahul   22     300             9                    8
3      Ansh   21     100             3                    9
4    Sohail   22     400            10                    4
5   Sridhar   23     200             2                    5
6  Atharava   20    1000             8                    7
7    Rounak   22     200            10                   10

Knowing the null data cells

In [21]:
data={
    "Name":['Ronit','Rishi','Rahul','Ansh','Sohail','Sridhar','Atharava','Rounak'],
    "Age":[20,21,22,21,22,23,20,22],
    "Salary":[1000,200,300,100,400,200,1000,200],
    "Performance_Measure":[10,7,8,9,4,5,7,10]
}
df=pd.DataFrame(data)

In [22]:
print(df.isnull())

    Name    Age  Salary  Performance_Measure
0  False  False   False                False
1  False  False   False                False
2  False  False   False                False
3  False  False   False                False
4  False  False   False                False
5  False  False   False                False
6  False  False   False                False
7  False  False   False                False

In [23]:
print(df.sum())

Name                   RonitRishiRahulAnshSohailSridharAtharavaRounak
Age                                                               171
Salary                                                           3400
Performance_Measure                                                60
dtype: object

In [24]:
print(df.isnull().sum())

Name                   0
Age                    0
Salary                 0
Performance_Measure    0
dtype: int64

In [25]:
print(df.dropna())

       Name  Age  Salary  Performance_Measure
0     Ronit   20    1000                   10
1     Rishi   21     200                    7
2     Rahul   22     300                    8
3      Ansh   21     100                    9
4    Sohail   22     400                    4
5   Sridhar   23     200                    5
6  Atharava   20    1000                    7
7    Rounak   22     200                   10

In [32]:
data={
    "Name":['Ronit',None,'Rahul','Ansh','Sohail','Sridhar','Atharava','Rounak'],
    "Age":[20,21,22,21,22,23,20,22],
    "Salary":[1000,200,300,100,400,200,1000,200],
    "Performance_Measure":[10,7,8,9,4,5,7,10]
}
df=pd.DataFrame(data)
print(df.dropna(inplace=True))
print(df)

None
       Name  Age  Salary  Performance_Measure
0     Ronit   20    1000                   10
2     Rahul   22     300                    8
3      Ansh   21     100                    9
4    Sohail   22     400                    4
5   Sridhar   23     200                    5
6  Atharava   20    1000                    7
7    Rounak   22     200                   10

In [35]:
data={
    "Name":['Ronit',None,'Rahul','Ansh','Sohail','Sridhar','Atharava','Rounak'],
    "Age":[20,21,22,21,22,23,20,22],
    "Salary":[1000,200,300,100,400,200,1000,200],
    "Performance_Measure":[10,7,8,9,4,5,7,10]
}
df=pd.DataFrame(data)
df.fillna("Rishi",inplace=True)

In [36]:
print(df)

       Name  Age  Salary  Performance_Measure
0     Ronit   20    1000                   10
1     Rishi   21     200                    7
2     Rahul   22     300                    8
3      Ansh   21     100                    9
4    Sohail   22     400                    4
5   Sridhar   23     200                    5
6  Atharava   20    1000                    7
7    Rounak   22     200                   10

Handling the missing values by mean of the method

In [69]:
import pandas as pd

data = {
    "Name": ['Ronit', 'Rishi', 'Rahul', 'Ansh', 'Sohail', 'Sridhar', 'Atharava', 'Rounak'],
    "Age": [20, 21, 22, 21, 22, 23, 20, 22],
    "Salary": [None, 200, 300, 100, 400, 200, 1000, 200],
    "Performance_Measure": [10, 7, 8, 9, 4, 5, 7, 10]
}

df = pd.DataFrame(data)

# Convert numerical columns to proper types
df = df.infer_objects(copy=False)

# Interpolate missing values
df_interpolated = df.interpolate(method='linear', axis=0)

print(df_interpolated)

       Name  Age  Salary  Performance_Measure
0     Ronit   20     NaN                   10
1     Rishi   21   200.0                    7
2     Rahul   22   300.0                    8
3      Ansh   21   100.0                    9
4    Sohail   22   400.0                    4
5   Sridhar   23   200.0                    5
6  Atharava   20  1000.0                    7
7    Rounak   22   200.0                   10

C:\Users\ronit2007\AppData\Local\Temp\ipykernel_26068\2305057798.py:16: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df_interpolated = df.interpolate(method='linear', axis=0)

In [79]:
data = {
    "Name": ['Ronit', 'Rishi', 'Rahul', 'Ansh', 'Sohail', 'Sridhar', 'Atharava', 'Rounak'],
    "Age": [20, 21, 22, 21, 22, 23, 20, 22],
    "Salary": [1000, 200, 300, 100, 400, 200, 1000, 200],
    "Performance_Measure": [10, 7, 8, 9, 4, 5, 7, 10]
}

df = pd.DataFrame(data)
df.sort_values(by=['Age','Salary'],ascending=[True,True],inplace=True)
print(df)

       Name  Age  Salary  Performance_Measure
0     Ronit   20    1000                   10
6  Atharava   20    1000                    7
3      Ansh   21     100                    9
1     Rishi   21     200                    7
7    Rounak   22     200                   10
2     Rahul   22     300                    8
4    Sohail   22     400                    4
5   Sridhar   23     200                    5

In [86]:
data = {
    "Name": ['Ronit', 'Rishi', 'Rahul', 'Ansh', 'Sohail', 'Sridhar', 'Atharava', 'Rounak'],
    "Age": [20, 21, 22, 21, 22, 23, 20, 22],
    "Salary": [1000, 200, 300, 100, 400, 200, 1000, 200],
    "Performance_Measure": [10, 7, 8, 9, 4, 5, 7, 10]
}

df = pd.DataFrame(data)
print(df["Salary"].sum())
print(df["Age"].mean())
print(df["Name"].count())
print(df["Age"].min())
print(df["Age"].max())

3400
21.375
8
20
23

Grouping

In [101]:
data = {
    "Name": ['Ronit', 'Rishi', 'Rahul', 'Ansh', 'Sohail', 'Sridhar', 'Atharava', 'Rounak'],
    "Age": [20, 21, 22, 21, 22, 23, 22, 20],
    "Salary": [1000, 200, 300, 100, 400, 200,200, 1000],
    "Performance_Measure": [10, 7, 8, 9, 4, 5, 7, 10]
}

df = pd.DataFrame(data)
print(df.groupby(["Age","Salary"])["Salary"].sum())

Age  Salary
20   1000      2000
21   100        100
     200        200
22   200        200
     300        300
     400        400
23   200        200
Name: Salary, dtype: int64

Now Concatenating two files

In [115]:
data1={
    'Name':["Ronit","Rounak","Rahul"],
    "Age":[20,20,21]
}
data_1=pd.DataFrame(data1)
data2={
    "Name":["Rahul","Rishi"],
    "Age":[21,23]
}
data_2=pd.DataFrame(data2)
pd.merge(data_1,data_2,on="Name",how='outer')

     Name  Age_x  Age_y
0   Rahul   21.0   21.0
1   Rishi    NaN   23.0
2   Ronit   20.0    NaN
3  Rounak   20.0    NaN

In [113]:
data1={
    'Name':["Ronit","Rounak","Rahul"],
    'Age':[20,20,21]
}
data_1=pd.DataFrame(data1)
data2={
    "Name":["Rahul","Rishi"],
    "Age":[21,23]
}
data_2=pd.DataFrame(data2)
pd.merge(data_1,data_2,on="Name",how='cross')

MergeError: Can not pass on, right_on, left_on or set right_index=True or left_index=True